tests/Chisel.Tests/DependencyGraphTest.MongoDbGraph_writeIgnoredPackages=False.verified.gv
# Generated by https://github.com/0xced/Chisel

digraph
{
  rankdir=LR
  node [ fontname = "Segoe UI, sans-serif", shape = box, style = filled, fillcolor = aquamarine, color = "#009061" ]

  "AWSSDK.SecurityToken" -> "AWSSDK.Core"
  "DnsClient" -> "Microsoft.Win32.Registry"
  "Microsoft.Extensions.Logging.Abstractions" -> "Microsoft.Extensions.DependencyInjection.Abstractions"
  "Microsoft.Win32.Registry" -> "System.Security.AccessControl"
  "Microsoft.Win32.Registry" -> "System.Security.Principal.Windows"
  "MongoDB.Bson" -> "System.Runtime.CompilerServices.Unsafe"
  "MongoDB.Driver" -> "Microsoft.Extensions.Logging.Abstractions"
  "MongoDB.Driver" -> "MongoDB.Bson"
  "MongoDB.Driver" -> "MongoDB.Driver.Core"
  "MongoDB.Driver" -> "MongoDB.Libmongocrypt"
  "MongoDB.Driver.Core" -> "AWSSDK.SecurityToken"
  "MongoDB.Driver.Core" -> "DnsClient"
  "MongoDB.Driver.Core" -> "Microsoft.Extensions.Logging.Abstractions"
  "MongoDB.Driver.Core" -> "MongoDB.Bson"
  "MongoDB.Driver.Core" -> "MongoDB.Libmongocrypt"
  "MongoDB.Driver.Core" -> "SharpCompress"
  "MongoDB.Driver.Core" -> "Snappier"
  "MongoDB.Driver.Core" -> "ZstdSharp.Port"
  "System.Security.AccessControl" -> "System.Security.Principal.Windows"

  "AWSSDK.Core" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "AWSSDK.SecurityToken" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "DnsClient"
  "Microsoft.Extensions.DependencyInjection.Abstractions"
  "Microsoft.Extensions.Logging.Abstractions"
  "Microsoft.Win32.Registry"
  "MongoDB.Bson"
  "MongoDB.Driver"
  "MongoDB.Driver.Core"
  "MongoDB.Libmongocrypt"
  "SharpCompress"
  "Snappier"
  "System.Runtime.CompilerServices.Unsafe"
  "System.Security.AccessControl"
  "System.Security.Principal.Windows"
  "ZstdSharp.Port"
}
